In [1]:
#Exemplo de Técnicas de Visualização de Dados Numéricos (EDA - Exploratory Data Analysis)

In [34]:
import pandas as pd
import numpy as np

In [3]:
#Importação de uma base de dados (Arquivo .csv)

In [4]:
df = pd.read_csv('D:/OneDrive/OneDrive - Etec Centro Paula Souza/Databases/credit_data.csv')

In [5]:
df

      i#clientid        income        age         loan  c#default
0              1  66155.925095  59.017015  8106.532131          0
1              2  34415.153966  48.117153  6564.745018          0
2              3  57317.170063  63.108049  8020.953296          0
3              4  42709.534201  45.751972  6103.642260          0
4              5  66952.688845  18.584336  8770.099235          1
...          ...           ...        ...          ...        ...
1995        1996  59221.044874  48.518179  1926.729397          0
1996        1997  69516.127573  23.162104  3503.176156          0
1997        1998  44311.449262  28.017167  5522.786693          1
1998        1999  43756.056605  63.971796  1622.722598          0
1999        2000  69436.579552  56.152617  7378.833599          0

[2000 rows x 5 columns]

In [6]:
df.columns = ['id', 'salario', 'idade', 'emprestimo', 'aprovado']

In [7]:
print(df.columns)

Index(['id', 'salario', 'idade', 'emprestimo', 'aprovado'], dtype='object')

In [8]:
df.shape

(2000, 5)

In [9]:
df.corr()

                  id   salario     idade  emprestimo  aprovado
id          1.000000  0.039280 -0.014704    0.018931 -0.020145
salario     0.039280  1.000000 -0.033687    0.441117  0.002284
idade      -0.014704 -0.033687  1.000000    0.002309 -0.429759
emprestimo  0.018931  0.441117  0.002309    1.000000  0.377160
aprovado   -0.020145  0.002284 -0.429759    0.377160  1.000000

In [10]:
df.max()

id             2000.000000
salario       69995.685578
idade            63.971796
emprestimo    13766.051239
aprovado          1.000000
dtype: float64

In [11]:
df.min()

id                1.00000
salario       20014.48947
idade           -52.42328
emprestimo        1.37763
aprovado          0.00000
dtype: float64

In [12]:
df.median()

id             1000.500000
salario       45789.117313
idade            41.317159
emprestimo     3974.719419
aprovado          0.000000
dtype: float64

In [13]:
df.head()

   id       salario      idade   emprestimo  aprovado
0   1  66155.925095  59.017015  8106.532131         0
1   2  34415.153966  48.117153  6564.745018         0
2   3  57317.170063  63.108049  8020.953296         0
3   4  42709.534201  45.751972  6103.642260         0
4   5  66952.688845  18.584336  8770.099235         1

In [14]:
df.head(3)

   id       salario      idade   emprestimo  aprovado
0   1  66155.925095  59.017015  8106.532131         0
1   2  34415.153966  48.117153  6564.745018         0
2   3  57317.170063  63.108049  8020.953296         0

In [15]:
df.tail(3)

        id       salario      idade   emprestimo  aprovado
1997  1998  44311.449262  28.017167  5522.786693         1
1998  1999  43756.056605  63.971796  1622.722598         0
1999  2000  69436.579552  56.152617  7378.833599         0

In [16]:
df.describe()

                id       salario        idade    emprestimo     aprovado
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459717    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [17]:
df[df['emprestimo'] <= 10.000]

      id       salario      idade  emprestimo  aprovado
66    67  37521.017173  60.541077    8.012076         0
865  866  28072.604355  54.142548    1.377630         0

In [18]:
df[df['salario'] >= 69500.000000]

        id       salario      idade    emprestimo  aprovado
150    151  69579.929211  57.756243  10868.241472         0
325    326  69958.705541  30.536020   8755.691977         1
346    347  69566.684349  52.967088   9875.037183         0
422    423  69995.685578  52.719673   2084.370861         0
1057  1058  69929.010996  51.394448  12427.835703         0
1350  1351  69592.010828  63.238625  13025.056571         0
1377  1378  69939.329678  55.637621   2225.224533         0
1378  1379  69755.320163  44.543682  13766.051239         0
1610  1611  69695.150449  26.424483   8418.253160         1
1902  1903  69852.058722  62.202313   9246.265058         0
1913  1914  69992.332712  41.771231     52.872190         0
1996  1997  69516.127573  23.162104   3503.176156         0

In [19]:
df[df['salario'] >= 69500.000000].count()

id            12
salario       12
idade         12
emprestimo    12
aprovado      12
dtype: int64

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          2000 non-null   int64
 1   salario     2000 non-null   float64
 2   idade       1997 non-null   float64
 3   emprestimo  2000 non-null   float64
 4   aprovado    2000 non-null   int64
dtypes: float64(3), int64(2)
memory usage: 78.2 KB

In [21]:
df.mean()

id             1000.500000
salario       45331.600018
idade            40.807559
emprestimo     4444.369695
aprovado          0.141500
dtype: float64

In [22]:
print("Média =", df.salario.mean())
print("Mediana =", df.salario.median())

Média = 45331.60001779331
Mediana = 45789.11731252445

In [23]:
df.query("salario > 69800.000000")

        id       salario      idade    emprestimo  aprovado
325    326  69958.705541  30.536020   8755.691977         1
422    423  69995.685578  52.719673   2084.370861         0
1057  1058  69929.010996  51.394448  12427.835703         0
1377  1378  69939.329678  55.637621   2225.224533         0
1902  1903  69852.058722  62.202313   9246.265058         0
1913  1914  69992.332712  41.771231     52.872190         0

In [24]:
df.query("salario > 55000.000000").mean()

id             1009.413961
salario       62352.778869
idade            40.236833
emprestimo     6053.479152
aprovado          0.139610
dtype: float64

In [25]:
df.salario.describe()

count     2000.000000
mean     45331.600018
std      14326.327119
min      20014.489470
25%      32796.459717
50%      45789.117313
75%      57791.281668
max      69995.685578
Name: salario, dtype: float64

In [26]:
df.aprovado.unique()

array([0, 1], dtype=int64)

In [27]:
df.aprovado.value_counts()

0    1717
1     283
Name: aprovado, dtype: int64

In [35]:
np.unique(df['aprovado'], return_counts=True)

(array([0, 1], dtype=int64), array([1717,  283], dtype=int64))

In [28]:
media_salario = df.groupby("id").mean().salario

In [29]:
media_salario.describe()

count     2000.000000
mean     45331.600018
std      14326.327119
min      20014.489470
25%      32796.459717
50%      45789.117313
75%      57791.281668
max      69995.685578
Name: salario, dtype: float64

In [30]:
media_salario.head()

id
1    66155.925095
2    34415.153966
3    57317.170063
4    42709.534201
5    66952.688845
Name: salario, dtype: float64

In [31]:
media_salario = df.groupby("emprestimo").mean().salario

In [32]:
media_salario.describe()

count     2000.000000
mean     45331.600018
std      14326.327119
min      20014.489470
25%      32796.459717
50%      45789.117313
75%      57791.281668
max      69995.685578
Name: salario, dtype: float64

In [33]:
media_salario.head(3)

emprestimo
1.377630     28072.604355
8.012076     37521.017173
15.498598    24904.064140
Name: salario, dtype: float64